MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA4L1BD4CFL/mcu.h
typedef struct                         /*!< (@ 0x40109000) R_DOC_B Structure                                          */
{
    union
    {
        __IOM uint8_t DOCR;            /*!< (@ 0x00000000) DOC Control Register                                       */

        struct
        {
            __IOM uint8_t OMS   : 2;   /*!< [1..0] Operating Mode Select                                              */
            uint8_t             : 1;
            __IOM uint8_t DOBW  : 1;   /*!< [3..3] Data Operation Bit Width Select                                    */
            __IOM uint8_t DCSEL : 3;   /*!< [6..4] Detection Condition Select                                         */
            uint8_t             : 1;
        } DOCR_b;
    };
    __IM uint8_t  RESERVED;
    __IM uint16_t RESERVED1;

    union
    {
        __IOM uint8_t DOSR;            /*!< (@ 0x00000004) DOC Flag Status Register                                   */

        struct
        {
            __IM uint8_t DOPCF : 1;    /*!< [0..0] Data Operation Circuit Flag                                        */
            uint8_t            : 7;
        } DOSR_b;
    };
    __IM uint8_t  RESERVED2;
    __IM uint16_t RESERVED3;

    union
    {
        __IOM uint8_t DOSCR;           /*!< (@ 0x00000008) DOC Flag Status Clear Register                             */

        struct
        {
            __OM uint8_t DOPCFCL : 1;  /*!< [0..0] DOPCF Clear                                                        */
            uint8_t              : 7;
        } DOSCR_b;
    };
    __IM uint8_t   RESERVED4;
    __IM uint16_t  RESERVED5;
    __IOM uint32_t DODIR;              /*!< (@ 0x0000000C) DOC Data Input Register                                    */
    __IOM uint32_t DODSR0;             /*!< (@ 0x00000010) DOC Data Setting Register 0                                */
    __IOM uint32_t DODSR1;             /*!< (@ 0x00000014) DOC Data Setting Register 1                                */
} R_DOC_B_Type;                        /*!< Size = 24 (0x18)                                                          */

/* =========================================================================================================================== */
/* ================                                          R_AGTX0                                          ================ */
/* =========================================================================================================================== */

/**
 * @brief Asynchronous General Purpose Timer (R_AGTX0)
 */

typedef struct                          /*!< (@ 0x400E8000) R_AGTX0 Structure                                          */
{
    union
    {
        __IOM R_AGTX0_AGT32_Type AGT32; /*!< (@ 0x00000000) AGTW (32-bit) peripheral registers                         */
        __IOM R_AGTX0_AGT16_Type AGT16; /*!< (@ 0x00000000) AGT (16-bit) peripheral registers                          */
    };
} R_AGTX0_Type;                         /*!< Size = 20 (0x14)                                                          */

/** @} */ /* End of group Device_Peripheral_peripherals */

/* =========================================================================================================================== */
/* ================                          Device Specific Peripheral Address Map                           ================ */
/* =========================================================================================================================== */

/** @addtogroup Device_Peripheral_peripheralAddr
 * @{
 */

 #define R_ACMPLP_BASE         0x400F4000UL
 #define R_ADC0_BASE           0x40170000UL
 #define R_ADC1_BASE           0x40170200UL
 #define R_PSCU_BASE           0x400E0000UL
 #define R_BUS_BASE            0x40003000UL
 #define R_CAC_BASE            0x40083600UL
 #define R_CANFD_BASE          0x400B0000UL
 #define R_CANFD1_BASE         0x400B2000UL
 #define R_CRC_BASE            0x40108000UL
 #define R_CTSU2_BASE          0x400D0000UL
 #define R_DAC_BASE            0x40171000UL
 #define R_DEBUG_BASE          0x4001B000UL
 #define R_DMA_BASE            0x40005200UL
 #define R_DMAC0_BASE          0x40005000UL
 #define R_DMAC1_BASE          0x40005040UL
 #define R_DMAC2_BASE          0x40005080UL
 #define R_DMAC3_BASE          0x400050C0UL
 #define R_DMAC4_BASE          0x40005100UL
 #define R_DMAC5_BASE          0x40005140UL
 #define R_DMAC6_BASE          0x40005180UL
 #define R_DMAC7_BASE          0x400051C0UL
 #define R_DTC_BASE            0x40005400UL
 #define R_ELC_BASE            0x40082000UL
 #define R_FACI_HP_CMD_BASE    0x407E0000UL
 #define R_FACI_HP_BASE        0x407FE000UL
 #define R_FACI_LP_BASE        0x407EC000UL
 #define R_CTSUTRIM_BASE       0x407EC000UL
 #define R_FCACHE_BASE         0x4001C000UL
 #define R_GPT0_BASE           0x40169000UL
 #define R_GPT1_BASE           0x40169100UL
 #define R_GPT2_BASE           0x40169200UL
 #define R_GPT3_BASE           0x40169300UL
 #define R_GPT4_BASE           0x40169400UL
 #define R_GPT5_BASE           0x40169500UL
 #define R_GPT6_BASE           0x40169600UL
 #define R_GPT7_BASE           0x40169700UL
 #define R_GPT8_BASE           0x40169800UL
 #define R_GPT9_BASE           0x40169900UL
 #define R_GPT10_BASE          0x40169A00UL
 #define R_GPT11_BASE          0x40169B00UL
 #define R_GPT12_BASE          0x40169C00UL
 #define R_GPT13_BASE          0x40169D00UL
 #define R_GPT_OPS_BASE        0x40169A00UL
 #define R_GPT_POEG0_BASE      0x4008A000UL
 #define R_GPT_POEG1_BASE      0x4008A100UL
 #define R_GPT_POEG2_BASE      0x4008A200UL
 #define R_GPT_POEG3_BASE      0x4008A300UL
 #define R_ICU_BASE            0x40006000UL
 #define R_IIC0_BASE           0x4009F000UL
 #define R_IIC1_BASE           0x4009F100UL
 #define R_IIC2_BASE           0x4009F200UL
 #define R_IRDA_BASE           0x40118F00UL
 #define R_IWDT_BASE           0x40083200UL
 #define R_I3C0_BASE           0x4011F000UL
 #define R_I3C1_BASE           0x4011F400UL
 #define R_MPU_MMPU_BASE       0x40000000UL
 #define R_MPU_SPMON_BASE      0x40000D00UL
 #define R_MSTP_BASE           0x40084000UL
 #define R_PORT0_BASE          0x4001F000UL
 #define R_PORT1_BASE          0x4001F020UL
 #define R_PORT2_BASE          0x4001F040UL
 #define R_PORT3_BASE          0x4001F060UL
 #define R_PORT4_BASE          0x4001F080UL
 #define R_PORT5_BASE          0x4001F0A0UL
 #define R_PORT6_BASE          0x4001F0C0UL
 #define R_PORT7_BASE          0x4001F0E0UL
 #define R_PORT8_BASE          0x4001F100UL
 #define R_PORT9_BASE          0x40080120UL
 #define R_PORT10_BASE         0x40080140UL
 #define R_PORT11_BASE         0x40080160UL
 #define R_PORT12_BASE         0x40080180UL
 #define R_PORT13_BASE         0x400801A0UL
 #define R_PORT14_BASE         0x400801C0UL
 #define R_PFS_BASE            0x4001F800UL
 #define R_PMISC_BASE          0x4001FD00UL
 #define R_QSPI_BASE           0x64000000UL
 #define R_RTC_BASE            0x40083000UL
 #define R_SCI0_BASE           0x40118000UL
 #define R_SCI1_BASE           0x40118100UL
 #define R_SCI2_BASE           0x40118200UL
 #define R_SCI3_BASE           0x40118300UL
 #define R_SCI4_BASE           0x40118400UL
 #define R_SCI5_BASE           0x40118500UL
 #define R_SCI6_BASE           0x40118600UL
 #define R_SCI7_BASE           0x40118700UL
 #define R_SCI8_BASE           0x40118800UL
 #define R_SCI9_BASE           0x40118900UL
 #define R_SLCDC_BASE          0x400D4000UL
 #define R_SPI0_BASE           0x4011A000UL
 #define R_SPI1_BASE           0x4011A100UL
 #define R_SPI2_BASE           0x40072200UL
 #define R_SRAM_BASE           0x40002000UL
 #define R_SSI0_BASE           0x4009D000UL
 #define R_SSI1_BASE           0x4009D100UL
 #define R_SYSTEM_BASE         0x4001E000UL
 #define R_TSN_BASE            0x407EC000UL
 #define R_USB_FS0_BASE        0x40090000UL
 #define R_UARTA0_BASE         0x40097000UL
 #define R_UARTA1_BASE         0x40097008UL
 #define R_UARTA_CK_BASE       0x40097010UL
 #define R_WDT_BASE            0x40083400UL
 #define R_TZF_BASE            0x40000E00UL
 #define R_CACHE_BASE          0x40007000UL
 #define R_CPSCU_BASE          0x40008000UL
 #define R_DOC_B_BASE          0x40109000UL
 #define R_AGTX0_BASE          0x400E8000UL
 #define R_AGTX1_BASE          0x400E8100UL
 #define R_AGTX2_BASE          0x400E8200UL
 #define R_AGTX3_BASE          0x400E8300UL
 #define R_AGTX4_BASE          0x400E8400UL
 #define R_AGTX5_BASE          0x400E8500UL
 #define R_AGTX6_BASE          0x400E8600UL
 #define R_AGTX7_BASE          0x400E8700UL
 #define R_AGTX8_BASE          0x400E8800UL
 #define R_AGTX9_BASE          0x400E8900UL
 #define R_WDT1_BASE           0x40044300UL

/** @} */ /* End of group Device_Peripheral_peripheralAddr */

/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */

/** @addtogroup Device_Peripheral_declaration
 * @{
 */

 #define R_ACMPLP         ((R_ACMPLP_Type *) R_ACMPLP_BASE)
 #define R_ADC0           ((R_ADC0_Type *) R_ADC0_BASE)
 #define R_ADC1           ((R_ADC0_Type *) R_ADC1_BASE)
 #define R_PSCU           ((R_PSCU_Type *) R_PSCU_BASE)

/* #define R_BUS                       ((R_BUS_Type*)             R_BUS_BASE) */
 #define R_CAC            ((R_CAC_Type *) R_CAC_BASE)
 #define R_CANFD          ((R_CANFD_Type *) R_CANFD_BASE)
 #define R_CANFD0         ((R_CANFD_Type *) R_CANFD_BASE)
 #define R_CANFD1         ((R_CANFD_Type *) R_CANFD1_BASE)
 #define R_CRC            ((R_CRC_Type *) R_CRC_BASE)
 #define R_CTSU           ((R_CTSU2_Type *) R_CTSU2_BASE)
 #define R_DAC            ((R_DAC_Type *) R_DAC_BASE)
 #define R_DEBUG          ((R_DEBUG_Type *) R_DEBUG_BASE)
 #define R_DMA            ((R_DMA_Type *) R_DMA_BASE)
 #define R_DMAC0          ((R_DMAC0_Type *) R_DMAC0_BASE)
 #define R_DMAC1          ((R_DMAC0_Type *) R_DMAC1_BASE)
 #define R_DMAC2          ((R_DMAC0_Type *) R_DMAC2_BASE)
 #define R_DMAC3          ((R_DMAC0_Type *) R_DMAC3_BASE)
 #define R_DMAC4          ((R_DMAC0_Type *) R_DMAC4_BASE)
 #define R_DMAC5          ((R_DMAC0_Type *) R_DMAC5_BASE)
 #define R_DMAC6          ((R_DMAC0_Type *) R_DMAC6_BASE)
 #define R_DMAC7          ((R_DMAC0_Type *) R_DMAC7_BASE)
 #define R_DTC            ((R_DTC_Type *) R_DTC_BASE)
 #define R_ELC            ((R_ELC_Type *) R_ELC_BASE)
 #define R_FACI_HP_CMD    ((R_FACI_HP_CMD_Type *) R_FACI_HP_CMD_BASE)
 #define R_FACI_HP        ((R_FACI_HP_Type *) R_FACI_HP_BASE)
 #define R_FACI_LP        ((R_FACI_LP_Type *) R_FACI_LP_BASE)
 #define R_CTSUTRIM       ((R_CTSUTRIM_Type *) R_CTSUTRIM_BASE)
 #define R_FCACHE         ((R_FCACHE_Type *) R_FCACHE_BASE)
 #define R_GPT0           ((R_GPT0_Type *) R_GPT0_BASE)
 #define R_GPT1           ((R_GPT0_Type *) R_GPT1_BASE)
 #define R_GPT2           ((R_GPT0_Type *) R_GPT2_BASE)
 #define R_GPT3           ((R_GPT0_Type *) R_GPT3_BASE)
 #define R_GPT4           ((R_GPT0_Type *) R_GPT4_BASE)
 #define R_GPT5           ((R_GPT0_Type *) R_GPT5_BASE)
 #define R_GPT6           ((R_GPT0_Type *) R_GPT6_BASE)
 #define R_GPT7           ((R_GPT0_Type *) R_GPT7_BASE)
 #define R_GPT8           ((R_GPT0_Type *) R_GPT8_BASE)
 #define R_GPT9           ((R_GPT0_Type *) R_GPT9_BASE)
 #define R_GPT10          ((R_GPT0_Type *) R_GPT10_BASE)
 #define R_GPT11          ((R_GPT0_Type *) R_GPT11_BASE)
 #define R_GPT12          ((R_GPT0_Type *) R_GPT12_BASE)
 #define R_GPT13          ((R_GPT0_Type *) R_GPT13_BASE)
 #define R_GPT_OPS        ((R_GPT_OPS_Type *) R_GPT_OPS_BASE)
 #define R_GPT_POEG0      ((R_GPT_POEG0_Type *) R_GPT_POEG0_BASE)
 #define R_GPT_POEG1      ((R_GPT_POEG0_Type *) R_GPT_POEG1_BASE)
 #define R_GPT_POEG2      ((R_GPT_POEG0_Type *) R_GPT_POEG2_BASE)
 #define R_GPT_POEG3      ((R_GPT_POEG0_Type *) R_GPT_POEG3_BASE)
 #define R_ICU            ((R_ICU_Type *) R_ICU_BASE)
 #define R_IIC0           ((R_IIC0_Type *) R_IIC0_BASE)
 #define R_IIC1           ((R_IIC0_Type *) R_IIC1_BASE)
 #define R_IIC2           ((R_IIC0_Type *) R_IIC2_BASE)
 #define R_IRDA           ((R_IRDA_Type *) R_IRDA_BASE)
 #define R_IWDT           ((R_IWDT_Type *) R_IWDT_BASE)
 #define R_I3C0           ((R_I3C0_Type *) R_I3C0_BASE)
 #define R_I3C1           ((R_I3C0_Type *) R_I3C1_BASE)
 #define R_MPU_MMPU       ((R_MPU_MMPU_Type *) R_MPU_MMPU_BASE)
 #define R_MPU_SPMON      ((R_MPU_SPMON_Type *) R_MPU_SPMON_BASE)
 #define R_MSTP           ((R_MSTP_Type *) R_MSTP_BASE)
 #define R_PORT0          ((R_PORT0_Type *) R_PORT0_BASE)
 #define R_PORT1          ((R_PORT0_Type *) R_PORT1_BASE)
 #define R_PORT2          ((R_PORT0_Type *) R_PORT2_BASE)
 #define R_PORT3          ((R_PORT0_Type *) R_PORT3_BASE)
 #define R_PORT4          ((R_PORT0_Type *) R_PORT4_BASE)
 #define R_PORT5          ((R_PORT0_Type *) R_PORT5_BASE)
 #define R_PORT6          ((R_PORT0_Type *) R_PORT6_BASE)
 #define R_PORT7          ((R_PORT0_Type *) R_PORT7_BASE)
 #define R_PORT8          ((R_PORT0_Type *) R_PORT8_BASE)
 #define R_PORT9          ((R_PORT0_Type *) R_PORT9_BASE)
 #define R_PORT10         ((R_PORT0_Type *) R_PORT10_BASE)
 #define R_PORT11         ((R_PORT0_Type *) R_PORT11_BASE)
 #define R_PORT12         ((R_PORT0_Type *) R_PORT12_BASE)
 #define R_PORT13         ((R_PORT0_Type *) R_PORT13_BASE)
 #define R_PORT14         ((R_PORT0_Type *) R_PORT14_BASE)
 #define R_PFS            ((R_PFS_Type *) R_PFS_BASE)
 #define R_PMISC          ((R_PMISC_Type *) R_PMISC_BASE)
 #define R_QSPI           ((R_QSPI_Type *) R_QSPI_BASE)
 #define R_RTC            ((R_RTC_Type *) R_RTC_BASE)
 #define R_SCI0           ((R_SCI0_Type *) R_SCI0_BASE)
 #define R_SCI1           ((R_SCI0_Type *) R_SCI1_BASE)
 #define R_SCI2           ((R_SCI0_Type *) R_SCI2_BASE)
 #define R_SCI3           ((R_SCI0_Type *) R_SCI3_BASE)
 #define R_SCI4           ((R_SCI0_Type *) R_SCI4_BASE)
 #define R_SCI5           ((R_SCI0_Type *) R_SCI5_BASE)
 #define R_SCI6           ((R_SCI0_Type *) R_SCI6_BASE)
 #define R_SCI7           ((R_SCI0_Type *) R_SCI7_BASE)
 #define R_SCI8           ((R_SCI0_Type *) R_SCI8_BASE)
 #define R_SCI9           ((R_SCI0_Type *) R_SCI9_BASE)
 #define R_SLCDC          ((R_SLCDC_Type *) R_SLCDC_BASE)
 #define R_SPI0           ((R_SPI0_Type *) R_SPI0_BASE)
 #define R_SPI1           ((R_SPI0_Type *) R_SPI1_BASE)
 #define R_SPI2           ((R_SPI0_Type *) R_SPI2_BASE)
 #define R_SRAM           ((R_SRAM_Type *) R_SRAM_BASE)
 #define R_SSI0           ((R_SSI0_Type *) R_SSI0_BASE)
 #define R_SSI1           ((R_SSI0_Type *) R_SSI1_BASE)
 #define R_SYSTEM         ((R_SYSTEM_Type *) R_SYSTEM_BASE)
 #define R_TSN            ((R_TSN_Type *) R_TSN_BASE)
 #define R_USB_FS0        ((R_USB_FS0_Type *) R_USB_FS0_BASE)
 #define R_UARTA0         ((R_UARTA0_Type *) R_UARTA0_BASE)
 #define R_UARTA1         ((R_UARTA0_Type *) R_UARTA1_BASE)
 #define R_UARTA_CK       ((R_UARTA_CK_Type *) R_UARTA_CK_BASE)
 #define R_WDT            ((R_WDT_Type *) R_WDT_BASE)
 #define R_TZF            ((R_TZF_Type *) R_TZF_BASE)
 #define R_CACHE          ((R_CACHE_Type *) R_CACHE_BASE)
 #define R_CPSCU          ((R_CPSCU_Type *) R_CPSCU_BASE)
 #define R_DOC_B          ((R_DOC_B_Type *) R_DOC_B_BASE)
 #define R_AGTW0          ((R_AGTX0_Type *) R_AGTX0_BASE)
 #define R_AGTW1          ((R_AGTX0_Type *) R_AGTX1_BASE)
 #define R_AGTW2          ((R_AGTX0_Type *) R_AGTX2_BASE)
 #define R_AGTW3          ((R_AGTX0_Type *) R_AGTX3_BASE)
 #define R_AGTW4          ((R_AGTX0_Type *) R_AGTX4_BASE)
 #define R_AGTW5          ((R_AGTX0_Type *) R_AGTX5_BASE)
 #define R_AGTW6          ((R_AGTX0_Type *) R_AGTX6_BASE)
 #define R_AGTW7          ((R_AGTX0_Type *) R_AGTX7_BASE)
 #define R_AGTW8          ((R_AGTX0_Type *) R_AGTX8_BASE)
 #define R_AGTW9          ((R_AGTX0_Type *) R_AGTX9_BASE)
 #define R_WDT1           ((R_WDT_Type *) R_WDT1_BASE)

